MakarenaLabs/Advanced-EasyWeb-LPC1768/src/tcpip.c
    TransmitControl &= ~SEND_FRAME2;             // clear tx-flag
  }

  if (TransmitControl & SEND_FRAME1)
  {
    PrepareTCP_DATA_FRAME();                     // build frame w/ actual SEQ, ACK....
    RequestSend(TxFrame1Size);
  
    if (Rdy4Tx())                                // CS8900 ready to accept our frame?
      SendFrame1();                              // (see note above)
    else {
      TCPStateMachine = CLOSED;
      SocketStatus = SOCK_ERR_ETHERNET;          // indicate an error to user
      TCPFlags = 0;                              // clear all flags, stop timers etc.
    }

    TransmitControl &= ~SEND_FRAME1;             // clear tx-flag
  }
}

// easyWEB internal function
// handles an incoming broadcast frame

void ProcessEthBroadcastFrame(void)
{
// CodeRed - change from int to short
//  unsigned int TargetIP[2];
  unsigned short TargetIP[2];


  
  if (ReadFrameBE_EthMAC() == FRAME_ARP)            // get frame type, check for ARP
    if (ReadFrameBE_EthMAC() == HARDW_ETH10)        // Ethernet frame
      if (ReadFrameBE_EthMAC() == FRAME_IP)         // check protocol
        if (ReadFrameBE_EthMAC() == IP_HLEN_PLEN)   // check HLEN, PLEN
          if (ReadFrameBE_EthMAC() == OP_ARP_REQUEST)
          {
            DummyReadFrame_EthMAC(6);               // ignore sender's hardware address
            CopyFromFrame_EthMAC(&RecdFrameIP, 4);  // read sender's protocol address
            DummyReadFrame_EthMAC(6);               // ignore target's hardware address
            CopyFromFrame_EthMAC(&TargetIP, 4);     // read target's protocol address
            if (!memcmp(&MyIP, &TargetIP, 4))    // is it for us?
              PrepareARP_ANSWER();               // yes->create ARP_ANSWER frame
          }
}

// easyWEB internal function
// handles an incoming frame that passed CS8900's address filter
// (individual addressed = IA)

void ProcessEthIAFrame(void)
{
// CodeRed - change from int to short
//unsigned int TargetIP[2];
  unsigned short TargetIP[2];
  unsigned char ProtocolType;

  switch (ReadFrameBE_EthMAC())                     // get frame type
  {
    case FRAME_ARP :                             // check for ARP
    {
      if ((TCPFlags & (TCP_ACTIVE_OPEN | IP_ADDR_RESOLVED)) == TCP_ACTIVE_OPEN)
        if (ReadFrameBE_EthMAC() == HARDW_ETH10)         // check for the right prot. etc.
          if (ReadFrameBE_EthMAC() == FRAME_IP)
            if (ReadFrameBE_EthMAC() == IP_HLEN_PLEN)
              if (ReadFrameBE_EthMAC() == OP_ARP_ANSWER)
              {
                TCPStopTimer();                       // OK, now we've the MAC we wanted ;-)
                CopyFromFrame_EthMAC(&RemoteMAC, 6);     // extract opponents MAC
                TCPFlags |= IP_ADDR_RESOLVED;
              }
      break;
    }
    case FRAME_IP :                                        // check for IP-type
    {
      if ((ReadFrameBE_EthMAC() & 0xFF00 ) == IP_VER_IHL)     // IPv4, IHL=5 (20 Bytes Header)
      {                                                    // ignore Type Of Service
        RecdIPFrameLength = ReadFrameBE_EthMAC();             // get IP frame's length
        ReadFrameBE_EthMAC();                                 // ignore identification

        if (!(ReadFrameBE_EthMAC() & (IP_FLAG_MOREFRAG | IP_FRAGOFS_MASK)))  // only unfragm. frames
        {
// CodeRed - add mask
//        ProtocolType = ReadFrameBE_EthMAC() ;                // get protocol, ignore TTL        	
          ProtocolType = ReadFrameBE_EthMAC() & 0xFF ;                // get protocol, ignore TTL
          ReadFrameBE_EthMAC();                               // ignore checksum
          CopyFromFrame_EthMAC(&RecdFrameIP, 4);              // get source IP
          CopyFromFrame_EthMAC(&TargetIP, 4);                 // get destination IP

          if (!memcmp(&MyIP, &TargetIP, 4))                // is it for us?
            switch (ProtocolType) {
              case PROT_ICMP : { ProcessICMPFrame(); break; }
              case PROT_TCP  : { ProcessTCPFrame(); break; }
              case PROT_UDP  : break;                      // not implemented!
            }
        }      
      }
      break;
    }
  }
}

// easyWEB internal function
// we've just rec'd an ICMP-frame (Internet Control Message Protocol)
// check what to do and branch to the appropriate sub-function

void ProcessICMPFrame(void)
{
// CodeRed - change from int to short
//unsigned int ICMPTypeAndCode;	
  unsigned short ICMPTypeAndCode;

  ICMPTypeAndCode = ReadFrameBE_EthMAC();           // get Message Type and Code
  ReadFrameBE_EthMAC();                             // ignore ICMP checksum

  switch (ICMPTypeAndCode >> 8) {                // check type
    case ICMP_ECHO :                             // is echo request?
    {
      PrepareICMP_ECHO_REPLY();                  // echo as much as we can...
      break;
    }
  }
}

// easyWEB internal function
// we've just rec'd an TCP-frame (Transmission Control Protocol)
// this function mainly implements the TCP state machine according to RFC793

void ProcessTCPFrame(void)
{
// CodeRed - change from int to short	

  unsigned short TCPSegSourcePort;                 // segment's source port
  unsigned short TCPSegDestPort;                   // segment's destination port
  unsigned long TCPSegSeq;                       // segment's sequence number
  unsigned long TCPSegAck;                       // segment's acknowledge number
  unsigned short TCPCode;                          // TCP code and header length
  unsigned char TCPHeaderSize;                   // real TCP header length
  unsigned short NrOfDataBytes;                    // real number of data
  
  
  TCPSegSourcePort = ReadFrameBE_EthMAC();                    // get ports
  TCPSegDestPort = ReadFrameBE_EthMAC();

  if (TCPSegDestPort != TCPLocalPort) return;              // drop segment if port doesn't match

  TCPSegSeq = (unsigned long)ReadFrameBE_EthMAC() << 16;      // get segment sequence nr.
  TCPSegSeq |= ReadFrameBE_EthMAC();

  TCPSegAck = (unsigned long)ReadFrameBE_EthMAC() << 16;      // get segment acknowledge nr.
  TCPSegAck |= ReadFrameBE_EthMAC();

  TCPCode = ReadFrameBE_EthMAC();                             // get control bits, header length...

  TCPHeaderSize = (TCPCode & DATA_OFS_MASK) >> 10;         // header length in bytes
  NrOfDataBytes = RecdIPFrameLength - IP_HEADER_SIZE - TCPHeaderSize;     // seg. text length

  if (NrOfDataBytes > MAX_TCP_RX_DATA_SIZE) return;        // packet too large for us :...-(

  if (TCPHeaderSize > TCP_HEADER_SIZE)                     // ignore options if any
    DummyReadFrame_EthMAC(TCPHeaderSize - TCP_HEADER_SIZE);

  switch (TCPStateMachine)                                 // implement the TCP state machine
  {
    case CLOSED :
    {
      if (!(TCPCode & TCP_CODE_RST))
      {
        TCPRemotePort = TCPSegSourcePort;
        memcpy(&RemoteMAC, &RecdFrameMAC, 6);              // save opponents MAC and IP
        memcpy(&RemoteIP, &RecdFrameIP, 4);                // for later use

